Repository: xmannv/xkey
Catalog: XKey/Localizable.xcstrings
Source language: vi
Languages: en, zh_hans

source: Đang tải lên iCloud...
en: Uploading to iCloud...
zh_hans: 正在上传到 iCloud...

source: Đang tải về từ iCloud...
en: Downloading from iCloud...
zh_hans: 正在从 iCloud 下载...

source: Chờ đồng bộ
en: Waiting to sync
zh_hans: 等待同步

source: Dung lượng: %@ / 1 MB
en: Size: %@ / 1 MB
zh_hans: 大小：%@ / 1 MB

source: Không thể đọc thiết lập
en: Cannot read settings
zh_hans: 无法读取设置

source: Vượt giới hạn 1MB iCloud
en: iCloud 1MB limit exceeded
zh_hans: 超过 iCloud 1MB 限制

source: iCloud Sync không khả dụng
en: iCloud Sync unavailable
zh_hans: iCloud 同步不可用

source: Vui lòng đăng nhập iCloud và bật iCloud Drive trên máy này. Trên macOS 26+, một số phiên bản phân phối ngoài App Store có thể tạm thời không hỗ trợ iCloud Sync.
en: Please sign in to iCloud and enable iCloud Drive on this Mac. On macOS 26+, some non-App Store distributions may temporarily not support iCloud Sync.
zh_hans: 请在本机登录 iCloud 并启用 iCloud Drive。在 macOS 26+ 上，部分非 App Store 分发版本可能暂不支持 iCloud 同步。

source: Export từ iCloud
en: Export from iCloud
zh_hans: 从 iCloud 导出

source: Không có dữ liệu trên iCloud
en: No data on iCloud
zh_hans: iCloud 上没有数据

source: Lưu thiết lập từ iCloud ra file
en: Save iCloud settings to file
zh_hans: 将 iCloud 设置保存到文件

source: Đã export thiết lập từ iCloud
en: iCloud settings exported successfully
zh_hans: 已成功导出 iCloud 设置

source: Hỗ trợ gõ tiếng Việt khi máy A remote (tắt XKey) -> máy B được remote (bật XKey + bật tính năng này)
en: Supports Vietnamese input when machine A is the controller (XKey off) → machine B is being remoted into (XKey on + enable this)
zh_hans: 支持在机器A远控（关XKey）→机器B被远控（开XKey+开此功能）时输入越南语

source: Máy này đang bị remote vào (Machine B)
en: This machine is being remoted into (Machine B)
zh_hans: 此机器正在被远程控制（机器B）

source: Bỏ qua viết tắt IN HOA bắt đầu bằng chữ Việt có dấu
en: Skip ALL-CAPS abbreviations that start with a marked Vietnamese letter
zh_hans: 跳过以带声调越南语字母开头的全大写缩写

source: Nếu bật: các viết tắt như ÂT, ÔM, ỨH sẽ không bị khôi phục về phím gõ thô. Trường hợp ĐN/ĐL luôn được giữ kể cả khi tuỳ chọn này tắt.
en: If enabled: abbreviations such as ÂT, ÔM, and ỨH will not be restored to raw keystrokes. ĐN/ĐL are always preserved even when this option is off.
zh_hans: 启用时：ÂT、ÔM、ỨH 等缩写不会被恢复为原始按键。即使关闭此选项，ĐN/ĐL 也始终会保留。

source: macOS Text Replacements đang trống
en: macOS Text Replacements is empty
zh_hans: macOS 文本替换为空

source: Không có mục mới để nhập
en: No new items to import
zh_hans: 没有可导入的新项目

source: Không có macro nào đang bật để export
en: No enabled macros to export
zh_hans: 没有已启用的宏可导出

source: Không thể tạo file .plist
en: Unable to create .plist file
zh_hans: 无法创建 .plist 文件

source: Lưu file .plist rồi kéo vào System Settings > Keyboard > Text Replacements
en: Save the .plist file, then drag it into System Settings > Keyboard > Text Replacements
zh_hans: 保存 .plist 文件，然后将其拖入“系统设置”>“键盘”>“文本替换”

source: Nhập từ file…
en: Import from file…
zh_hans: 从文件导入…

source: Xuất ra file…
en: Export to file…
zh_hans: 导出到文件…

source: Nhập từ Text Replacements
en: Import from Text Replacements
zh_hans: 从文本替换导入

source: Đồng bộ sang Text Replacements…
en: Sync to Text Replacements…
zh_hans: 同步到文本替换…

source: Nhập / Xuất
en: Import / Export
zh_hans: 导入 / 导出

source: Đồng bộ macro sang Text Replacements
en: Sync macros to Text Replacements
zh_hans: 将宏同步到文本替换

source: Để dùng macro trên iPhone/iPad qua iCloud của Apple.
en: Use macros on iPhone/iPad via Apple iCloud.
zh_hans: 通过 Apple iCloud 在 iPhone/iPad 上使用宏。

source: Export file .plist
en: Export .plist file
zh_hans: 导出 .plist 文件

source: Mở Text Replacements
en: Open Text Replacements
zh_hans: 打开文本替换

source: Trong pane Keyboard, bấm nút “Text Replacements…”.
en: In the Keyboard pane, click “Text Replacements…”.
zh_hans: 在“键盘”面板中，点击“文本替换…”。

source: Sau khi Export, file .plist hiện sẵn trong Finder. Kéo file đó thả vào danh sách trong cửa sổ Text Replacements.
en: After export, the .plist file is shown in Finder. Drag it into the list in the Text Replacements window.
zh_hans: 导出后，.plist 文件会在 Finder 中显示。将该文件拖入“文本替换”窗口中的列表。

source: Trùng từ viết tắt sẽ tạo bản đôi. Đừng đẩy hàng nghìn macro một lần — macOS dễ lỗi ở số lượng lớn.
en: Duplicate shortcuts will create duplicate entries. Do not push thousands of macros at once — macOS can fail with very large batches.
zh_hans: 重复的缩写会创建重复项。不要一次同步数千个宏——macOS 在大量数据时容易出错。

source: Chỉ viết hoa khi sau dấu câu có dấu cách
en: Only capitalize when punctuation is followed by a space
zh_hans: 仅在标点后有空格时才自动大写

source: Nếu bật: chỉ viết hoa sau \". ? !\" khi theo sau là dấu cách (vd \"google.com\", \"3.14\", \"file.txt\" không bị viết hoa). Xuống dòng vẫn luôn viết hoa. Nếu tắt: viết hoa ngay sau dấu câu kể cả khi không có dấu cách.
en: If enabled: only capitalize after “. ? !” when followed by a space (for example, “google.com”, “3.14”, and “file.txt” will not be capitalized). New lines are still always capitalized. If disabled: capitalize immediately after punctuation even without a space.
zh_hans: 启用时：仅在“. ? !”后面跟着空格时才自动大写（例如“google.com”、“3.14”、“file.txt”不会被大写）。换行后仍会始终大写。关闭时：即使标点后没有空格，也会立即大写。

source: BẬT khi máy này là máy đích (machine B) — máy đang bị remote control bởi Jump Desktop, AnyDesk, TeamViewer, RustDesk, v.v. Khi BẬT: XKey luôn lắng nghe keyboard events từ remote desktop daemon (bypass HID tap). Cho phép gõ tiếng Việt bình thường trên máy B khi máy A disable XKey. Để TẮT khi máy A disable XKey và bạn muốn gõ tiếng Việt trực tiếp trên máy B.
en: Enable when this Mac is the target machine (machine B) — the machine being remotely controlled by Jump Desktop, AnyDesk, TeamViewer, RustDesk, etc. When enabled: XKey always listens for keyboard events from the remote desktop daemon (bypassing the HID tap). This allows normal Vietnamese typing on machine B when XKey is disabled on machine A. Leave disabled when XKey is disabled on machine A and you want to type Vietnamese directly on machine B.
zh_hans: 当这台 Mac 是目标机器（机器 B）时启用——即由 Jump Desktop、AnyDesk、TeamViewer、RustDesk 等远程控制的机器。 启用时：XKey 会始终监听来自远程桌面守护进程的键盘事件（绕过 HID tap）。当机器 A 禁用 XKey 时，仍可在机器 B 上正常输入越南语。 当机器 A 禁用 XKey 且你想直接在机器 B 上输入越南语时，请保持关闭。

source: Dành cho máy A (máy đang điều khiển). BẬT khi máy B không có bộ gõ tiếng Việt. Khi BẬT: XKey inject tiếng Việt qua clipboard paste (Cmd+V / Ctrl+V). Tương thích (thử nghiệm): • ✓ Jump Desktop — gõ chậm (~1 giây / từ) hoạt động ổn định • ✓ AnyDesk, Parallels, VMware Fusion, Apple Remote Desktop — tương tự Jump Desktop • ✗ RustDesk — KHÔNG hỗ trợ (strict-check HID modifier state). Dùng manual Cmd+C/Ctrl+V. • ⚠ TeamViewer, Microsoft RDC — chưa kiểm thử kỹ Yêu cầu: Bật đồng bộ clipboard trong ứng dụng remote desktop.
en: For machine A (the controlling machine). Enable when machine B does not have a Vietnamese input method. When enabled: XKey injects Vietnamese text through clipboard paste (Cmd+V / Ctrl+V). Compatibility (experimental): • ✓ Jump Desktop — slow typing (~1 second / word) works reliably • ✓ AnyDesk, Parallels, VMware Fusion, Apple Remote Desktop — similar to Jump Desktop • ✗ RustDesk — NOT supported (strict HID modifier-state checks). Use manual Cmd+C/Ctrl+V. • ⚠ TeamViewer, Microsoft RDC — not thoroughly tested Requirement: enable clipboard sync in the remote desktop app.
zh_hans: 用于机器 A（控制端机器）。当机器 B 没有越南语输入法时启用。 启用时：XKey 通过剪贴板粘贴（Cmd+V / Ctrl+V）注入越南语文本。 兼容性（实验性）： • ✓ Jump Desktop — 慢速输入（约 1 秒 / 词）运行稳定 • ✓ AnyDesk、Parallels、VMware Fusion、Apple Remote Desktop — 类似 Jump Desktop • ✗ RustDesk — 不支持（严格检查 HID 修饰键状态）。请手动使用 Cmd+C/Ctrl+V。 • ⚠ TeamViewer、Microsoft RDC — 尚未充分测试 要求：在远程桌面应用中启用剪贴板同步。

source: Nếu bật: chỉ viết hoa sau ". ? !" khi theo sau là dấu cách (vd "google.com", "3.14", "file.txt" không bị viết hoa). Xuống dòng vẫn luôn viết hoa. Nếu tắt: viết hoa ngay sau dấu câu kể cả khi không có dấu cách.
en: If enabled: only capitalize after “. ? !” when followed by a space (for example, “google.com”, “3.14”, and “file.txt” will not be capitalized). New lines are still always capitalized. If disabled: capitalize immediately after punctuation even without a space.
zh_hans: 启用时：仅在“. ? !”后面跟着空格时才自动大写（例如“google.com”、“3.14”、“file.txt”不会被大写）。换行后仍会始终大写。关闭时：即使标点后没有空格，也会立即大写。

source: Trạng thái bộ gõ
en: Input engine state
zh_hans: 输入引擎状态

source: Ghi đè trạng thái bộ gõ
en: Override input engine state
zh_hans: 覆盖输入引擎状态

source: Bộ gõ:
en: Input engine:
zh_hans: 输入引擎：

source: Bật bộ gõ
en: Enable input engine
zh_hans: 启用输入引擎

source: Tắt bộ gõ
en: Disable input engine
zh_hans: 禁用输入引擎

source: Ép bật xử lý tiếng Việt cho window/app này
en: Force-enable Vietnamese processing for this window/app
zh_hans: 为此窗口/应用强制启用越南语处理

source: Ép tắt xử lý tiếng Việt cho window/app này
en: Force-disable Vietnamese processing for this window/app
zh_hans: 为此窗口/应用强制禁用越南语处理

source: Không override
en: Do not override
zh_hans: 不覆盖

source: Bật
en: On
zh_hans: 开启

source: Tắt
en: Off
zh_hans: 关闭

source: Chế độ:
en: Mode:
zh_hans: 模式：

source: Gửi U+202F trước khi replace để phá autocomplete, sau đó backspace thêm 1. Chỉ áp dụng cho Fast/Slow.
en: Send U+202F before replacement to break autocomplete, then backspace one extra character. Only applies to Fast/Slow.
zh_hans: 在替换前发送 U+202F 以打断自动补全，然后额外退格一次。仅适用于 Fast/Slow。

source: %lld entries
zh_hans: %lld 条

source: 1000µs = 1ms. Increase delay if characters are lost.
zh_hans: 1000µs = 1ms。如果丢字符,请增加延迟。

source: A product of Codetay.com
zh_hans: Codetay.com 出品

source: AX Description:
zh_hans: AX 描述:

source: AX Identifier:
zh_hans: AX 标识符:

source: AX Matching
zh_hans: AX匹配

source: AX Role:
zh_hans: AX 角色:

source: Actions
zh_hans: 操作

source: Advanced Options
zh_hans: 高级选项

source: App:
zh_hans: 应用程序:

source: Auto Advance
zh_hans: 自动前进

source: Auto Clear Text
zh_hans: 自动清除文本

source: Auto-Scroll
zh_hans: 自动滚动

source: Auto-cycle through all methods + text sending combinations
zh_hans: 自动循环所有注入方法 + 文本发送组合

source: Backspace (µs):
zh_hans: 退格 (µs):

source: Backspace delay:
zh_hans: 退格延迟:

source: Buy me a coffee
zh_hans: 请我喝杯咖啡

source: Caret Context
zh_hans: 光标上下文

source: Check
zh_hans: 检查

source: Check accessibility status of target app (see Log tab)
zh_hans: 检查目标应用的辅助功能状态 (查看日志标签)

source: Clear
zh_hans: 清除

source: Clear & Reset
zh_hans: 清除并重置

source: Clear text after fail to test next method
zh_hans: 失败后清除文本以测试下一个方法

source: Commit Delay
zh_hans: 提交延迟

source: Commit Delay (µs):
zh_hans: 提交延迟 (µs):

source: Copy
zh_hans: 复制

source: DOM Classes:
zh_hans: DOM 类:

source: Debug
zh_hans: 调试

source: Emoji 🇻🇳 / 🇬🇧
zh_hans: 表情符号 🇻🇳 / 🇬🇧

source: Enable
zh_hans: 启用

source: Enable AXManualAccessibility for Electron/Chromium apps
zh_hans: 为 Electron/Chromium 应用启用 AXManualAccessibility

source: Enabled
zh_hans: 已启用

source: English
zh_hans: 英语

source: Expected Result
zh_hans: 预期结果

source: Export
zh_hans: 导出

source: Force Accessibility
zh_hans: 强制辅助功能

source: Import
zh_hans: 导入

source: Injection Method
zh_hans: 注入方法

source: Injection Method Test
zh_hans: 注入方法测试

source: Input Element
zh_hans: 输入元素

source: Input Keys
zh_hans: 输入按键

source: Input Source:
zh_hans: 输入源:

source: Input Sources
zh_hans: 输入源

source: Macro
zh_hans: 宏

source: Marked Text
zh_hans: 标记文本

source: Match mode:
zh_hans: 匹配模式:

source: Method:
zh_hans: 方法:

source: Pattern matching
zh_hans: 模式匹配

source: Pattern:
zh_hans: 模式:

source: Pause (%llds)
zh_hans: 暂停 (%lld 秒)

source: Paused
zh_hans: 已暂停

source: Quick Telex
zh_hans: 快速Telex

source: Recording
zh_hans: 录制中

source: Remote Desktop
zh_hans: 远程桌面

source: Reset
zh_hans: 重置

source: Rule Match:
zh_hans: 规则匹配:

source: Search...
zh_hans: 搜索...

source: Smart Switch
zh_hans: 智能切换

source: Support XKey
zh_hans: 支持 XKey

source: Target:
zh_hans: 目标:

source: Test App Behavior Detector (Spotlight/Raycast/Alfred/etc.)
zh_hans: 测试应用行为检测器 (Spotlight/Raycast/Alfred 等)

source: Test Input
zh_hans: 测试输入

source: Test Log
zh_hans: 测试日志

source: Test if XKey injection works correctly in any app
zh_hans: 测试 XKey 在任意应用中的注入是否正常工作

source: Text (µs):
zh_hans: 文本 (µs):

source: Text Sending
zh_hans: 文本发送

source: Text delay:
zh_hans: 文本延迟:

source: Title Pattern:
zh_hans: 标题模式:

source: Toggle AXManualAccessibility for target app
zh_hans: 切换目标应用的 AXManualAccessibility

source: Type characters directly. Example: 'asnh', 'xin chaof'
zh_hans: 直接输入字符。例如:'asnh'、'xin chaof'

source: Verbose
zh_hans: 详细

source: Vietnamese Input Method for macOS
zh_hans: macOS越南语输入法

source: Wait (µs):
zh_hans: 等待 (µs):

source: Wait delay:
zh_hans: 等待延迟:

source: Web Content
zh_hans: 网页内容

source: Window Title:
zh_hans: 窗口标题:

source: Word After Caret
zh_hans: 光标后的词

source: Word Before Caret
zh_hans: 光标前的词

source: XKey Debug
zh_hans: XKey 调试

source: XKeyIM Input Method:
zh_hans: XKeyIM 输入法：

source: lines
zh_hans: 行

source: • License: GPL (GNU General Public License)
zh_hans: • 许可证:GPL (GNU 通用公共许可证)

source: Hotkeys
zh_hans: 快捷键

source: iCloud Sync
zh_hans: iCloud 同步

source: Remote Session Tap
zh_hans: 远程会话拦截

source: Empty Char Prefix
zh_hans: 空字符前缀
